class ItemDescriptions {
  static const String cactusPickaxeDescription = '''Кактусова кирка — це кирка ранньої гри. Вона має таку саму потужність кирки, як мідна та олов’яна кирка, але трохи повільнішу з точки зору швидкості видобутку. Як і інші кирки нижчого рівня, він може добувати лише блоки та руди, слабші за Метеорит (що вимагає кирки з принаймні 50% потужності кирки, наприклад, вольфрамова кирка). 

Її найкращий модифікатор — Легендарний. Хоча може здатися, що Легкий забезпечує кращий приріст швидкості у відсотках, округлення показує, що Легендарний і Легкий добувають з однаковою швидкістю для цього інструменту.''';
  static const String cooperPickaxeDescription = '''Мідна кирка — це кирка ранньої гри, яка слабша за залізну та свинцеву кирку. Порівняно зі своєю альтернативною версією руди, олов’яною киркою, вона має таку саму потужність кирки, але завдає на 1 менше шкоди та повільніша з точки зору швидкості видобутку. Крім того, він має атрибут діапазону -1, що означає, що він може добувати лише 4 блоки з боків і 2 блоки вище та нижче гравця. Як і інші кирки нижчого рівня, він може добувати лише блоки та руди, слабші за Метеорит (що вимагає кирки з принаймні 50% потужності кирки, наприклад, вольфрамова кирка).

Мідна кирка зазвичай є першою киркою, яку отримує гравець, оскільки новостворені персонажі з’являються з цим предметом у своєму другому слоті інвентарю, якщо не в режимі подорожі.

Крім того, мідну кирку можна придбати у Торговця за 5 срібла.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String tinPickaxeDescription = '''Олов'яна кирка — це кирка ранньої гри, яка слабша за залізну та свинцеву. Порівняно зі своєю альтернативною версією руди, мідною киркою, вона має таку саму потужність кирки, але завдає на 1 більше шкоди, трохи швидша з точки зору швидкості видобутку та має довший радіус дії на 1 клітинку. Як і інші кирки нижчого рівня, він може добувати лише блоки та руди, слабші за Метеорит (що вимагає кирки з принаймні 50% потужності кирки, наприклад, вольфрамова кирка).

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String ironPickaxeDescription = '''Залізна кирка — це кирка ранньої гри, яка міцніша за мідну та олов’яну, але слабша за срібну та вольфрамову. Порівняно зі своєю альтернативною версією руди, свинцевою киркою, вона має меншу силу кирки, завдає на 1 менше шкоди та трохи повільніша з точки зору швидкості видобутку. Як і інші кирки нижчого рівня, він може добувати лише блоки та руди, слабші за Метеорит (що вимагає кирки з принаймні 50% потужності кирки, наприклад, вольфрамова кирка).

У режимі подорожі залізна кирка замінює мідну кирку як початковий предмет для нових персонажів.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String leadPickaxeDescription = '''Свинцева кирка — це кирка ранньої гри, яка міцніша за мідну та олов’яну, але слабша за срібну та вольфрамову. Порівняно зі своєю альтернативною версією руди, Залізною киркою, вона має більшу силу кирки, завдає на 1 більше шкоди та трохи швидша з точки зору швидкості видобутку. Як і інші кирки нижчого рівня, він може добувати лише блоки та руди, слабші за Метеорит (що вимагає кирки з принаймні 50% потужності кирки, наприклад, вольфрамова кирка).

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String silverPickaxeDescription = '''Срібна кирка — це кирка ранньої гри, яка сильніша за залізну та свинцеву, але слабша за золоту та платинову кирку. Порівняно зі своєю альтернативною версією руди, вольфрамовою киркою, вона має меншу потужність кирки, але значно швидша з точки зору швидкості видобутку. На відміну від вольфрамової кирки, вона не здатна добувати метеорит.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String titaniumDrillDescription = '''Титанове свердло — це свердло у складному режимі, яке є альтернативою Титановій кирці. Не дивлячись на зовнішній вигляд і звуки, обидва інструменти функціонально майже ідентичні, однак свердло на пів секунди швидше. Але, на відміну від кирки, більшість свердел не можна перекувати за допомогою модифікаторів розміру, швидкості або віддачі.

Воно може добувати всі блоки, крім хлорофітової руди і ящщерової цегли.

Його найкращим модифікатором є Демонічний, оскільки воно не має відкидання, тому не може отримати модифікатори, які впливають на нього, і, крім того, не може отримати модифікатори, які впливають на його швидкість.
''';
  static const String cooperAxeDescription = '''Мідна сокира — це перша сокира, яку отримає гравець, і вона слабша за залізну або свинцеву. У неї є альтернативна рудна версія, олов’яна сокира, яка є трохи міцнішою. Мідна сокира тепер використовується для виготовлення сокири відродження у версії 1.4.4. Новостворені персонажі з’являться з цим предметом у третьому слоті інвентарю. Як і всі сокири, його використовують для вирубування дерев, кактусів і гігантських сяючих грибів. Крім того, його можна придбати у Торговця за 4 срібла.

Її найкращий модифікатор — Легкий для добування та Спритний, або Силовий/Сильний для бойових цілей, завдяки надзвичайно низькій базовій шкоді. Хоча вона може отримати модифікатор Безжальний, зменшене відкидання може бути небажаним на ранніх етапах гри.
''';
  static const String tinAxeDescription = '''Олов’яна сокира — це сокира ранньої гри, сильніша за початкову мідну та слабша за залізну та свинцеву сокири. Як і всі сокири, він використовується для рубання дерев, кактусів і гігантських сяючих грибів.

Його найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String ironAxeDescription = '''Залізна сокира — це сокира ранньої гри, сильніша за початкову мідну та слабша за срібну чи вольфрамову. У неї є альтернативна рудна версія, свинцева сокира, яка трохи міцніша. Як і всі сокири, її використовують для вирубування дерев, кактусів і гігантських сяючих грибів.

У режимі подорожі ви починаєте із залізною сокирою разом із залізним мечем і залізною киркою.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String leadAxeDescription = '''Свинцева сокира — це сокира ранньої гри, сильніша за початкову мідну та слабша за срібну або вольфрамову сокири. У неї є альтернативна рудна версія, Залізна сокира, яка є трохи слабшою. Як і всі сокири, вона використовується для рубання дерев, кактусів і гігантських сяючих грибів.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String silverAxeDescription = '''Срібна сокира — це сокира ранньої гри, вона сильніша за залізну чи свинцеву та слабша за золоту чи платинову сокиру. Вона має альтернативну версію, Вольфрамова сокира, яка трохи міцніша. Як і всі сокири, вона використовується для вирубування дерев, кактусів і гігантських сяючих грибів.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String tungstenAxeDescription = '''Вольфрамова сокира - це сокира ранньої гри, вона сильніша за залізну та свинцеву сокири та слабша за золоту та платинову сокири. У неї є альтернативна версія, Срібна сокира, яка трохи слабша. Як і всі сокири, вона використовується для рубання дерев, кактусів і гігантських сяючих грибів.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String goldAxeDescription = '''Золота сокира — це сокира ранньої гри, вона сильніша за срібну або вольфрамову сокиру, але слабша за Бойову сокиру ночі чи Кровожерного гіганта. У неї є альтернативна рудна версія, Платинова сокира, яка є дещо міцнішою. Як і всі сокири, її використовують для вирубування дерев, кактусів і гігантських сяючих грибів.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String platinumAxeDescription = '''Платинова сокира — це сокира ранньої гри, вона сильніша за срібну та вольфрамову сокири та слабша за Бойову сокиру ночі та Кровожерного гіганта. Вона має альтернативну версію, Золота сокира, яка трохи слабша. Як і всі сокири, вона використовується для рубання дерев, кактусів і гігантських сяючих грибів.

Її найкращий модифікатор — Легкий для добування та Легендарний для бойових цілей.
''';
  static const String cobaltChainsawDescription = '''Кобальтова бензопила — це бензопила в складному режимі, яку можна отримати після перемоги над Стіною плоті та є альтернативою кобальтовій бойовій сокирі. Хоча кобальтова бойова сокира та кобальтова бензопила мають однакову силу сокири, бойова сокира рубає дерева швидше (якщо не діють посилення/модифікатори). Це один із найперших доступних інструментів для сокири після входу в складний режим разом із його дещо сильнішою рудною альтернативою — паладієвою бензопилою. Як і всі сокири та бензопили, він використовується для рубання дерев, кактусів і гігантських сяючих грибів.

Її найкращий модифікатор - Божественний або Демонічний. Обидва модифікатори збільшують середню шкоду на однакову величину.
''';
  static const String butchersChainsawDescription = '''Бензопила м’ясника — це бензопила в складному режимі, після Плантери, яка має 2,5% / 3,75% (1/40 / 3/80) ймовірність випасти з м’ясників під час сонячного затемнення. Ударивши ворога чи істоту, вона випромінює іскри, схожі на снаряди, які виробляє Жезл іскор, також завдаючи шкоди ворогам поблизу/додатковим сегментам. Ці іскри завдають шкоди ближнього бою/магічної шкоди, тобто будь-які посилення ближнього/магічного бою, аксесуари чи броня посилять їх. Вони також мають шанс накласти негативний ефект пекельного вогню.

Її найкращий модифікатор - Божественний або Демонічний. Обидва модифікатори збільшують середню шкоду на однакову величину. Модифікатор Демонічний не має 15% посилення відкидання.
''';
}